{
  "facts": [
    {
      "title": "Делимость",
      "theme": "algebra",
      "body": "Данный способ целесообразно применять не всегда. Анализ условий, при которых может быть осуществлено деление позволяет получить информацию, которая будет необходима для решения задачи.",
      "id": "2"
    },
    {
      "title": "Связь геометрических и алгебраических интерпретаций",
      "theme": "algebra",
      "body": " Практически всегда при решении геометрических задач необходимо обращаться к использованию алгебры. Для этого необходимо создать алгебраическую модель геометрической ситуации, которая исследуется и позволяет дать ответ на все вопросы задачи.",
      "id": "3"
    },
    {
      "title": "Переход к новым переменным",
      "theme": "algebra",
      "body": "Соотношения в задаче обязательно записываются при использовании формул. От правильного использования формул зависит правильное исследование. Формулу можно упрощать, применяя новые переменные или иные характеристики.",
      "id": "4"
    },
    {
      "title": "Способ индукции",
      "theme": "algebra",
      "body": "Индукция широко применяется в многих науках. Она позволяет после разбора нескольких частных случаев выделить определенную гипотезу, которая может повлиять на решение задачи.",
      "id": "5"
    },
    {
      "title": "Способ бесконечного спуска",
      "theme": "algebra",
      "body": "Проанализировав задачу можно заметить организацию бесконечного процесса. Исследование всех условий, при которых возможен бесконечный процесс помогает получить дополнительную информацию, которая необходима для решения задачи.",
      "id": "6"
    },
    {
      "title": "Способ оценки",
      "theme": "algebra",
      "body": "Данный способ использует углублённые условия, переходы к неравенствам, которые сохраняют соотношения между объектами исследования.",
      "id": "7"
    },
    {
      "title": "Сведение к квадратному уравнению",
      "theme": "algebra",
      "body": "Решение многих олимпиадных задач можно свести к исследованию квадратных уравнений, при этом используются связи между коэффициентами и корнями, условие существование корней.",
      "id": "8"
    },
    {
      "title": "Рассмотрение частных случаев",
      "theme": "algebra",
      "body": "Данный способ связан с использованием конкретизации условия задачи и анализом связей между рассмотренными случаями и общей ситуацией.",
      "id": "9"
    },
    {
      "title": "Внутренняя симметрия",
      "theme": "algebra",
      "body": "Данный способ целесообразнее использовать в случае если определенные преобразования не нарушают отношений между величинами задачи.",
      "id": "10"
    },
    {
      "title": "Инвариант",
      "theme": "algebra",
      "body": "Инвариант – это то, что может измениться в некотором процессе. Полуинвариант – это, что может измениться в некотором процессе в одну определенную сторону. Задачи с использованием инварианта или полуинварианта можно разделить на два вида: – требующие доказать инвариантность данной величины; – те, в которых используется инвариант, но при решении сразу не очевиден. Принцип решения задач данным способом основывается на поиске действий, которые напрямую относятся к данной задаче. Данный способ самый сложный и остается всегда непонятным в применении. Для того, что понять суть данного метода необходимо обратить внимание на усвоение самой логики применения инварианта.",
      "id": "11"
    },
    {
      "title": "Способ взвешивания",
      "theme": "algebra",
      "body": "Суть данного способа состоит в том, чтобы локализовать отличающийся от остальных предмет по весу за ограниченное число взвешиваний. Поиск решений при использовании данного метода сводится к операции сравнения одиночных элементов, так и их групп.",
      "id": "12"
    },
    {
      "title": "Рекурсия",
      "theme": "algebra",
      "body": "Определение, описание, изображение какого-либо объекта или процесса внутри самого этого объекта или процесса, то есть ситуация, когда объект является частью самого себя.",
      "id": "13"
    },
    {
      "title": "Прыжки Виета",
      "theme": "algebra",
      "body": "Способ доказательства, используемый в теории чисел. Наиболее часто он применяется для задач, в которых дано соотношение между двумя натуральными числами и требуется доказать некоторое связанное с ними утверждение. Существует несколько вариаций метода прыжков Виета, которые так или иначе связаны с общей темой бесконечного спуска, где из данного решения находится новое (меньшее) решение с помощьюформул Виета.",
      "id": "14"
    },
    {
      "title": "Доказательство от противного",
      "theme": "algebra",
      "body": "Один из самых часто используемых способов доказательства утверждений. Доказательство от противного - вид доказательства, при котором «доказывание» некоторого суждения (тезиса доказательства) осуществляется через опровержение отрицания этого суждения - антитезиса. Этот способ доказательства основывается на истинности закона двойного отрицания в классической логике.",
      "id": "15"
    }
  ]
}